// Найти квадрат числа

Console.WriteLine("Введите число ");
int a =  int.Parse(Console.ReadLine());
int count = (a*a);
Console.WriteLine("Квадрат число равен "+ count );
